benpye/rtos/drv/ch32x035_usb/src/pac/ch32x035_usbfs.svd
        <register derivedFrom="EP0_TX_LEN">
          <name>EP%s_TX_LEN</name>
          <description>Endpoint transmit length.</description>
          <addressOffset>0x64</addressOffset>
          <dim>3</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>5-7</dimIndex>
        </register>
        <register>
          <name>EP%s_CTRL_H</name>
          <description>Endpoint control register.</description>
          <addressOffset>0x22</addressOffset>
          <dim>5</dim>
          <dimIncrement>4</dimIncrement>
          <size>0x10</size>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>T_RES</name>
              <description>Endpoint transmitter response control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NYET</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NAK</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STALL</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R_RES</name>
              <description>Endpoint receiver response control.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NYET</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NAK</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STALL</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T_TOG</name>
              <description>Endpoint transmitter toggle bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R_TOG</name>
              <description>Endpoint receiver toggle bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="EP0_CTRL_H">
          <name>EP%s_CTRL_H</name>
          <description>Endpoint control register.</description>
          <addressOffset>0x66</addressOffset>
          <dim>3</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>5-7</dimIndex>
        </register>
        <register>
          <name>EPX_CTRL</name>
          <description>Endpoint X control register.</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>T_EN</name>
              <description>Endpoint (8-15) transmit enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R_EN</name>
              <description>Endpoint (8-15) receive enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_AF</name>
              <description>Transmit endpoint alternate enable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
